# CurrentChanged Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBox..::..CurrentChanged Event
ComboBox Class See Also
---
Subscribe to this event to be notified when the current item of the ComboBox is changed.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public event EventHandler<ComboBoxCurrentChangedEventArgs> CurrentChanged
```

Visual Basic
---
```text
Public Event CurrentChanged As EventHandler(Of ComboBoxCurrentChangedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<ComboBoxCurrentChangedEventArgs^>^ CurrentChanged {
	void add (EventHandler<ComboBoxCurrentChangedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxCurrentChangedEventArgs^>^ value);
}
```

# See Also
ComboBox Class
Autodesk.Revit.UI Namespace